collected-data/mfs-4-rep-results/experiements-1-3/1-failure/tf/fio-mfs-test-low-seq-read-tf.txt
Started: 08-04-2022--21-13-06

low-seq-read-/mnt/mfs: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-read-/mnt/mfs: Laying out IO file (1 file / 100MiB)

low-seq-read-/mnt/mfs: (groupid=0, jobs=1): err= 0: pid=20587: Fri Apr  8 21:14:25 2022
  read: IOPS=129, BW=16.2MiB/s (17.0MB/s)(72.4MiB/4472msec)
    slat (usec): min=53, max=2766.0k, avg=11063.79, stdev=156141.34
    clat (nsec): min=1746, max=16482, avg=2416.66, stdev=728.82
     lat (usec): min=56, max=2766.1k, avg=7730.95, stdev=134033.58
    clat percentiles (nsec):
     |  1.00th=[ 1816],  5.00th=[ 1880], 10.00th=[ 1880], 20.00th=[ 1880],
     | 30.00th=[ 1960], 40.00th=[ 2576], 50.00th=[ 2576], 60.00th=[ 2640],
     | 70.00th=[ 2640], 80.00th=[ 2640], 90.00th=[ 2640], 95.00th=[ 2736],
     | 99.00th=[ 2800], 99.50th=[ 6496], 99.90th=[16512], 99.95th=[16512],
     | 99.99th=[16512]
   bw (  KiB/s): min=32833, max=41728, per=100.00%, avg=37280.50, stdev=6289.71, samples=2
   iops        : min=  256, max=  326, avg=291.00, stdev=49.50, samples=2
  lat (usec)   : 2=33.22%, 4=66.26%, 10=0.35%, 20=0.17%
  cpu          : usr=0.00%, sys=0.31%, ctx=581, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=578,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=16.2MiB/s (17.0MB/s), 16.2MiB/s-16.2MiB/s (17.0MB/s-17.0MB/s), io=72.4MiB (75.9MB), run=4472-4472msec
low-seq-read-/mnt/mfs: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-read-/mnt/mfs: Laying out IO file (1 file / 100MiB)

low-seq-read-/mnt/mfs: (groupid=0, jobs=1): err= 0: pid=21062: Fri Apr  8 21:15:44 2022
  read: IOPS=158, BW=19.9MiB/s (20.9MB/s)(72.4MiB/3639msec)
    slat (usec): min=53, max=3104.7k, avg=11636.51, stdev=175409.42
    clat (nsec): min=1815, max=12851, avg=2513.44, stdev=701.43
     lat (usec): min=56, max=2737.9k, avg=6289.21, stdev=119217.04
    clat percentiles (nsec):
     |  1.00th=[ 1816],  5.00th=[ 1816], 10.00th=[ 1880], 20.00th=[ 2512],
     | 30.00th=[ 2576], 40.00th=[ 2576], 50.00th=[ 2576], 60.00th=[ 2576],
     | 70.00th=[ 2576], 80.00th=[ 2640], 90.00th=[ 2640], 95.00th=[ 2736],
     | 99.00th=[ 3152], 99.50th=[ 6560], 99.90th=[12864], 99.95th=[12864],
     | 99.99th=[12864]
   bw (  KiB/s): min= 8960, max=65667, per=100.00%, avg=37313.50, stdev=40097.90, samples=2
   iops        : min=   70, max=  513, avg=291.50, stdev=313.25, samples=2
  lat (usec)   : 2=19.03%, 4=80.28%, 10=0.35%, 20=0.35%
  cpu          : usr=0.00%, sys=0.41%, ctx=582, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=578,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=19.9MiB/s (20.9MB/s), 19.9MiB/s-19.9MiB/s (20.9MB/s-20.9MB/s), io=72.4MiB (75.9MB), run=3639-3639msec
low-seq-read-/mnt/mfs: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-read-/mnt/mfs: Laying out IO file (1 file / 100MiB)

low-seq-read-/mnt/mfs: (groupid=0, jobs=1): err= 0: pid=21543: Fri Apr  8 21:17:04 2022
  read: IOPS=156, BW=19.6MiB/s (20.6MB/s)(72.4MiB/3689msec)
    slat (usec): min=53, max=2869.9k, avg=11072.17, stdev=166727.79
    clat (nsec): min=1815, max=36736, avg=2430.45, stdev=1601.51
     lat (usec): min=56, max=2869.9k, avg=6376.43, stdev=122620.56
    clat percentiles (nsec):
     |  1.00th=[ 1816],  5.00th=[ 1816], 10.00th=[ 1816], 20.00th=[ 1880],
     | 30.00th=[ 1880], 40.00th=[ 2512], 50.00th=[ 2576], 60.00th=[ 2576],
     | 70.00th=[ 2640], 80.00th=[ 2640], 90.00th=[ 2640], 95.00th=[ 2736],
     | 99.00th=[ 3152], 99.50th=[ 6304], 99.90th=[36608], 99.95th=[36608],
     | 99.99th=[36608]
   bw (  KiB/s): min= 8960, max=65667, per=100.00%, avg=37313.50, stdev=40097.90, samples=2
   iops        : min=   70, max=  513, avg=291.50, stdev=313.25, samples=2
  lat (usec)   : 2=37.89%, 4=61.25%, 10=0.52%, 20=0.17%, 50=0.17%
  cpu          : usr=0.08%, sys=0.27%, ctx=590, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=578,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=19.6MiB/s (20.6MB/s), 19.6MiB/s-19.6MiB/s (20.6MB/s-20.6MB/s), io=72.4MiB (75.9MB), run=3689-3689msec